#pragma once

// Куб с нормалями
const float CUBE_VERTICES[] = {
    // Позиция                // Нормали          // КоордыТекстур
    // лицевая
    -0.5f, -0.5f,  0.5f,    0.0f,  0.0f,  1.0f,   0.0f, 0.0f,
     0.5f, -0.5f,  0.5f,    0.0f,  0.0f,  1.0f,   1.0f, 0.0f,
     0.5f,  0.5f,  0.5f,    0.0f,  0.0f,  1.0f,   1.0f, 1.0f,
    -0.5f,  0.5f,  0.5f,    0.0f,  0.0f,  1.0f,   0.0f, 1.0f,
    // задняя
     0.5f, -0.5f, -0.5f,    0.0f,  0.0f, -1.0f,   0.0f, 0.0f,
    -0.5f, -0.5f, -0.5f,    0.0f,  0.0f, -1.0f,   1.0f, 0.0f,
    -0.5f,  0.5f, -0.5f,    0.0f,  0.0f, -1.0f,   1.0f, 1.0f,
     0.5f,  0.5f, -0.5f,    0.0f,  0.0f, -1.0f,   0.0f, 1.0f,
    // правая
     0.5f, -0.5f,  0.5f,    1.0f,  0.0f,  0.0f,   0.0f, 0.0f,
     0.5f, -0.5f, -0.5f,    1.0f,  0.0f,  0.0f,   1.0f, 0.0f,
     0.5f,  0.5f, -0.5f,    1.0f,  0.0f,  0.0f,   1.0f, 1.0f,
     0.5f,  0.5f,  0.5f,    1.0f,  0.0f,  0.0f,   0.0f, 1.0f,
    // левая
    -0.5f, -0.5f, -0.5f,   -1.0f,  0.0f,  0.0f,   0.0f, 0.0f,
    -0.5f, -0.5f,  0.5f,   -1.0f,  0.0f,  0.0f,   1.0f, 0.0f,
    -0.5f,  0.5f,  0.5f,   -1.0f,  0.0f,  0.0f,   1.0f, 1.0f,
    -0.5f,  0.5f, -0.5f,   -1.0f,  0.0f,  0.0f,   0.0f, 1.0f,
    // верх
    -0.5f,  0.5f,  0.5f,    0.0f,  1.0f,  0.0f,   0.0f, 0.0f,
     0.5f,  0.5f,  0.5f,    0.0f,  1.0f,  0.0f,   1.0f, 0.0f,
     0.5f,  0.5f, -0.5f,    0.0f,  1.0f,  0.0f,   1.0f, 1.0f,
    -0.5f,  0.5f, -0.5f,    0.0f,  1.0f,  0.0f,   0.0f, 1.0f,
    // низ
    -0.5f, -0.5f, -0.5f,    0.0f, -1.0f,  0.0f,   0.0f, 0.0f,
     0.5f, -0.5f, -0.5f,    0.0f, -1.0f,  0.0f,   1.0f, 0.0f,
     0.5f, -0.5f,  0.5f,    0.0f, -1.0f,  0.0f,   1.0f, 1.0f,
    -0.5f, -0.5f,  0.5f,    0.0f, -1.0f,  0.0f,   0.0f, 1.0f,
};

const unsigned int CUBE_INDICES[] = {
    0,  1,  2,   2,  3,  0,   // лиц
    4,  5,  6,   6,  7,  4,   // зад
    8,  9,  10,  10, 11, 8,   // право
    12, 13, 14,  14, 15, 12,  // лево
    16, 17, 18,  18, 19, 16,  // верх
    20, 21, 22,  22, 23, 20   // низ
};

const int CUBE_VERTEX_COUNT = 24;
const int CUBE_INDEX_COUNT = 36;
const int CUBE_STRIDE = 8;

// пол
const float FLOOR_VERTICES[] = {
    // Позиция                // Нормали          // КоордыТекстур
    -50.0f, 0.0f, -50.0f,      0.0f, 1.0f, 0.0f,   0.0f,  0.0f,
     50.0f, 0.0f, -50.0f,      0.0f, 1.0f, 0.0f,   10.0f, 0.0f,
     50.0f, 0.0f,  50.0f,      0.0f, 1.0f, 0.0f,   10.0f, 10.0f,
    -50.0f, 0.0f,  50.0f,      0.0f, 1.0f, 0.0f,   0.0f,  10.0f,
};

const unsigned int FLOOR_INDICES[] = { 0, 1, 2, 2, 3, 0 };

const int FLOOR_VERTEX_COUNT = 4;
const int FLOOR_INDEX_COUNT = 6;
const int FLOOR_STRIDE = 8;

// Стена
const float WALL_VERTICES[] = {
    // Позиция                // Нормали          // КоордыТекстур
    -25.0f,  0.0f, 0.0f,       0.0f, 0.0f, 1.0f,   0.0f, 0.0f,
     25.0f,  0.0f, 0.0f,       0.0f, 0.0f, 1.0f,   5.0f, 0.0f,
     25.0f, 15.0f, 0.0f,       0.0f, 0.0f, 1.0f,   5.0f, 3.0f,
    -25.0f, 15.0f, 0.0f,       0.0f, 0.0f, 1.0f,   0.0f, 3.0f,
};

const unsigned int WALL_INDICES[] = { 0, 1, 2, 2, 3, 0 };

const int WALL_VERTEX_COUNT = 4;
const int WALL_INDEX_COUNT = 6;
const int WALL_STRIDE = 8;
